{"The collection of data is achieved with which of the following changes.": "Dynamic Nature", "The number of devices that need to be managed and that communicate with each other will be much larger.": "Enormous Scale", "Which characteristics involve the facility the thing to respond in an intelligent way to a particular situation?": "Intelligence", "which of the following empowers IoT by bringing together everyday objects.": "Connectivity", "Which of the following Provide the means to create capability that reflects true awareness of the physical world and people.": "Sensors", "By clicking which key the PubNub will display public, subscribe, and secret keys.": "Demo Keyset", "PubNub publishes and subscribes which of the following in order to send and receive messages.": "Keys", "The messageChannel class declares the which of the following class attribute that defines the key string.": "command_key", "Which of the following  specifies the function that will be called when there is a new message received from the channel.": "Callback", "which specifies the function that will be called on an error event.": "Error", "How many wires does SPI protocol use": "4", "What does VNC stand for": "Virtual Network Computing", "What is Inter Integrated Communication(I2C)": "A networking communication protocol for multi-master support", "What is Secure Shell (SSH)": "A network protocol", "What is the purpose of bin directory in Linux environment": "Contains essential binary commands", "An IoT center is which of the following envisaged as an important part of the generic IoT platform to unify the organization.": "Integrated Information", "Capacitive touch sensor has moving parts.": "False", "Does information resource management need to be integrated into market management?": "True", "How many types of touch sensors are present?": "2 types", "How the voice is transferred to our phone": "Internet", "In order to promote Which of the following the government should employ more management.": "eGovermnent related", "IoT is a paradigm that involves ubiquitous presence in the environment.": "True", "IoT promotes the creation of IoT terminal industry": "Clusters", "ITS stands for": "Intelligent Transportation Services", "Supplementary platforms in the architecture provide support for these services.": "True", "The core element of architecture of smart city is": "Integrated Information Provider", "The core element of internet of things  is operated by": "IoT service Provider", "The IoT platforms are mainly divided into how many types": "4 types", "The use of RFID in product logistics may realize automatic acquisition of logistics information.": "True", "Which challenge comes under IoT devices, reliable bidirectional signaling.": "Signaling", "Which challenge comes under securing the information?": "Security", "Which of the following empowers IoT by bringing together everyday objects.": "Connectivity", "Which of the following in IoT as one of the key characteristics, devices have different hardware platforms and networks.": "Heterogeneity", "Which of the following provide the means to create capability that reflects true awareness of the physical world and people.": "Sensors", "Which sensor is used in mobile phones?": "Capacitive touch sensor", "Which touchscreen is coated with a transparent material?": "Resistive touchscreen", "Who will use their own IoT business models?": "Service provider", "In order to improve their competitiveness and services assurance, which of the following require independently funded IoT projects.": "Enterprise-based", "In order to promote which of the following the government should employ more management.": "eGovermnent related", "Which of the following  may become an important facilitator and stimulate for the modern economy.": "Business oriented platform", "Open IoT manages the registration, data acquisition, deployment of sensors and interconnected of objects, through which network?": "X-GSN", "Open IoT ontology is extending the W3C SSN ontology which supports the description of the physical and processing structure of sensors.": "True", "What is the sensor/protocol used in GSN?": "CoAP protocol", "Which environment does Global Sensor Network work on?": "JAVA", "Which is the core wrapper of GSN?": "ZeroMQWrapper", "Future application of IoT through phones includes viewing data and controlling sensors anywhere.": "True", "Which category could be used by citizens to contribute to a smart city?": "Community IoT", "Which category is used for business to consumer process?": "Industrial IoT", "Which category is used in the context of connected cars?": "Group IoT", "Which layer is the communication layer that connects the IoT devices with WAN.": "Network layer", "IoT devices are naturally vulnerable to Which of the following threats.": "Security", "Which of the following  gives an exact, up to the second state of all devices on a network.": "Presence detection", "which of the following  in IoT as one of the key characteristics, devices have different hardware platforms and networks.": "Heterogeneity", "BAN gives": "Communication and storage", "BAN stands for": "Body Area Network", "Smart phones can be used in IoT setup with how many applications categories.": "4 Applications", "Thread would allow which of the following networks.": "Mesh", "Which category finds an increase in applications targeting health and fitness?": "Personal IoT", "The core element is operated by": "IoT service Provider", "Which approach is used in this architecture?": "Top down approach", "An IoT which of the following center is envisaged as an important part of the generic IoT platform to unify the organization.": "Integrated Information", "The autonomous chose from below  based IoT platforms are used for internal management of the corresponding enterprise.": "Company based", "which of the following specifies the function that will be called when a successful re-connection is completed.": "Reconnect", "which of the following specifies the function that will be called when the client disconnects.": "Disconnect", "Bluetooth 5.0 promises:": "2x Speed, 4x Range, 8x Data", "IANA stands for:": "Internet Assigned Numbers Authority", "Is CoAP a IETF standard?": "True", "Is MQTT a Standard?": "Yes", "Standard port number for secure MQTT is:": "8883", "MQTT is better than HTTP for sending and receiving data.": "True", "MQTT is which of the given below protocol.": "Machine to Machine and Internet of Things", "MQTT stands for": "MQ Telemetry Transport", "which of the below allows us to control electronic components": "RETful API", "Which protocol is lightweight?": "MQTT"}