{"Intellectual Property Rights (IPR) protect the use of information and ideas that are of": "Commercial value", "The term ‘Intellectual Property Rights’ covers": "All of the above", "The following can not be exploited by assigning or by licensing the rights to others.": "Trademark", "The following can be patented": "All of the above", "In ‘quid-pro-quo’, quo stands for": "monopoly granted for the term of the patent", "Trade mark": "All of the above", "The digital revolution is also known as:": "3rd revolution", "When was Linux created:": "1991", "The information revolution of the 1990s and 2000s was:": "Both Internet and PC", "The open source software movement continues to ensure the democratization and openness of:": "All of the above", "Who is the founding father of the free software movement:": "Richard Stallman", "The users must agree to the _______ terms and agreements when they use an open source softwareThe user must agree to the ": "License", "Which of the following is not a downside of OSS?": "Multiple choices", "An example of a web design OSS.": "Nvu", "An image editor similar to Adobe Photoshop": "GIMPshop", "An OSS for communication purpose.": "Pidgin", "FOSS stand for": "free open source software", "In FOSS, Source code is openly shred": "The correct answer is 'True'.", "The term free software in": "1986", "The term “open\nsource” was formally adopted in": "1999", "The GNU project mentions that Many people believe that […] you should not charge money for distributing copies of\nthe software, or that you should charge as little as possible — just enough to\ncover the cost, this is a misunderstanding.": "The correct answer is 'True'.", "Open source software is software whose source code is available for modification or enhancement by anyone. Which of the following is an example of open source software?": "Libre Office", "An image editor similar to Adobe Photoshop.": "GIMPshop", "Who founded the Free Software Foundation?": "Richard Stallman", "How many freedoms are protected by free software?": "4", "Which of the following is a free software license?": "GPL", "Which of the following is a free operating system?": "Linux/GNU", "GIMP which type of application?": "graphics", "In  computing\ninternationalization means": "adapting computer software to different\nlanguages", "What is localization ": "uses\nthe infrastructure or flexibility provided by internationalization", "NLS stand for": "Native language support", "Which of the following is not an open source software?": "Microsoft Office", "Which of the following is the most famous example of open source software?": "Linux", "What is correcting errors in a program called?": "Debugging", "A compiler translates a program written in a high-level language into": "Macine language", "What does a program’s end-user license agreement (EULA) typically include?": "All", "When you buy a typical computer software package, you are purchasing": "A license to use the software", "The dmesg command": "kernel log messages", "The command “mknod myfifo b 4 16”": "Will create a block device if user is root", "Which command is used to set terminal IO characteristic?": "stty", "Which command is used to record a user login session in a file": "script", "TCO stand for": "Total cost of ownership", "Which command is used to display the unix version": "uname -r", "Which command is used to print a file": " lpr", "Using which command you find resource limits to the session?": " ulimit", "Which option of ls command used to view file inode number": "–i", "Find / -name ‘*’ will": "List all files and directories recursively starting from /"}