{"The design model provides detail about the software’s –": "All above", "Software design is an ___________\nthrough which requirements are translated into a blueprint for constructing the\nsoftware.": "Iterative process", "Design begins at a _______\nof abstraction that can be directly traced back to the data, functional, and\nbehavioral requirements": "High level", "Each element of the\nanalysis model provides information that is necessary to create the ____ design\nmodels": "4", "The _________ defines\nthe relationship between major structural elements of the software; architectural\nstyles and design patterns help achieve the requirements defined for the system": "Architectural design", "The degree of interaction within a module is called -": "Cohesion", "A systematic mechanism for decomposing the problem is called -": "Decomposability ", "In Common Coupling, both modules have access to the same\nglobal data area.": "The correct answer is 'True'.", "In Content Coupling, one module directly references the\ninternals of another.": "The correct answer is 'True'.", "The degree of interaction between modules is called Coupling.": "The correct answer is 'True'.", "The ______ translates the requirements into a completed design model  for a software product.": "Design", "The ______ provides the representations of software that can be assessed for quality.": "Design", "Requirement analysis models and specification\ndoc are the _______ of Software Design activity.": "Input", "Design models and design specification doc are the  ___________ of software design activity.": "Output", "______ defines the relationship among major structural elements of the program.": "Architecture design", "_______ transforms the information domain model\ninto data structures.": "Data Design", "__________describes how the software communicates\nwith users.": "Interface Design", "________ transforms structural elements of the program architecture into a procedural description of software components.": "Procedure Design", "The design should reviewed to minimize\nconceptual errors. ": "The correct answer is 'True'.", "The design should be traceable to the analysis\nmodel.": "The correct answer is 'True'.", "________ is the process of applying various\ntechniques and principles for the purpose of defining a device, a process or a\nsystem in sufficient detail to permit its realization.": "Design", "A software\ndecomposition into modules–description of what each module is intended to do\nand of the ________ among the modules.": "Relationship", "_________ requires\ndata dictionary and entity–relationship diagram. ": "Data design", "_________ consists of data flow diagrams. It depicts the\nrelationships between major “structural elements” of the software, various\ndesign patterns and various design pattern constraints.": "Architectural\nDesign", "___________ requires\ncontrol specifications, state transition diagrams and data flow diagrams. It\ndepicts the inter–communication path of the software.": "Interface Design", "________ involves the control specification, state\ntransition diagram and process specification. It converts the structural\ncomponents of the software architecture into a procedural description of the\nsoftware components.": "Component level\nDesign", " The _______  is produced to tell the customer exactly what\nthe system will do. It belongs to the “what” part of the solution.": "Conceptual\ndesign", " The ___________ describes the hardware\nconfiguration, the software needs, communication interfaces, the input and\noutput of the system, the software architecture, and anything else that\ntranslates the requirements into a solution to the customer’s problem.": "Technical\nDesign", "A complex system\nmay be divided into simpler pieces called __________.": "Modules", "__________ is the\nsingle attribute of software that allows a program to be intellectually\nmanageable.": "Modularity", "Which of the following are non-functional requirements?": "Customized user interface", "A good requirement must be": "Testable and unambiguous both", "Information hiding is to hide from user details\n": "That are not relevant to him", "System specifications are used to ": "All above", "The systematic process of documenting\nrequirements through an interactive cooperative process of analyzing a problem\nis called ____________.": "Requirement Engineering", "________ is a condition of capability, needed\nby a user to solve a problem or achieve an objective.": "Requirement ", "___________ are the services which the end users expect the final\nproduct to provide and focuses on the functionality of the software components\nthat build the system. ": "Functional requirements ", "_______ are the constraints imposed on the system\nand deal with issues like Security, Maintainability, Performance, Reliability\netc. and play a very important role in deciding the destiny of the software\nproject.  ": "Non-Functional Requirements", "Some requirements are specific to an application domain e.g. hospital,\nbanking, marketing etc. these requirements are known as_____________.": "Domain Requirements", "The process of acquiring domain specific knowledge/information through\nvarious techniques to build the ‘Requirements Model’ is called _________.": "Requirement Elicitation", "SRS stands for -": "Software Requirement Specification", "Following is one of the quality characteristics\nof SRS -": "All above", "The output of Requirement Engineering Process\nis _______.": "SRS", "_________ is a document which contains the\ncomplete description of software without talking about implementation details.": "SRS", "_______ in the SRS is supported only if each\nand every requirement stated in it has only one interpretation.": "Unambiguousness", "An SRS is said to be ______ if there is no\nconflict between the requirement in the documents.": "Consistency", "SRS is ______ if origin of the each requirement\nis clearly documented.": "Traceable", "An SRS is\nsaid to be _______________ if it does not include any implementation details.": "Design independent", "The segment ‘Overall Description’ of SRS\nconsists –": "All above", "Requirement Specification Document is also\ncalled as Software Requirement Specification.": "The correct answer is 'True'.", "­­­­­­­­­­_________ is the review of software product and its related documentation\nfor completeness, correctness, reliability and maintainability. ": "Quality assurance", "________ includes assurance, that the system meets the specification and the requirement for its intended use and performance.": "Quality assurance", "_________ process is done after each phase to\ndetermine that the product of the given phase of development fulfill\nspecifications of the previous phase.": "Verification", "________ is the process of evaluating system at the end of\nthe system development to ensure that the system fulfill the specification and\nrequirements and required functions. ": "Validation", "_______ is common method of validation. ": "Dynamic", "In the ______ method verification code reading,\ncode review, walkthrough’s and errors are detected directly. It is quite\nattractive and economical method. ": "Static", "Testing is the phase, where errors remaining from\nall the previous phases must be detected.": "The correct answer is 'True'.", "‘Live test data’ are those that are actually extracted from organization files.": "The correct answer is 'True'.", "‘Error’ refers to the\ndifference between the actual output of the software and the correct output.": "The correct answer is 'True'.", "Testing through test data is done only in _______  method of V&V.": "Dynamic", "Testing without the use of test data and verification\nthrough code reading and code review, is only done in _______  method of V&V.": "Static", "Fault is –": "A condition that causes a system to fail in performing its required\nfunction", "A __________ is a\nmechanism; different from the program itself, that can be used to check the\ncorrectness of the output of the program for the test cases.": "Test oracle", "_______ is also called ‘Program Testing’. ": "Unit\ntesting", "_________ is used to\ndetermine whether the system will handle the volume of activities that occur,\nwhen the system is at peak of its processing demand. ": "System Testing", "System\nvalidation is achieved through a series of ________ tests that demonstrate conformity\nwith requirements. ": "Black Box", "Testing starts with a ‘test plan’ and terminates with ‘acceptance testing’.": "The correct answer is 'True'.", "‘Error’ refers to the difference between the actual output of the software and the correct output.": "The correct answer is 'True'.", "Testing\nshould be based on user requirements": "The correct answer is 'True'.", "The ­­­­­­­­­________ is\nthe last phase before the final software is delivered. ": "Testing", "_________ has\nresponsibility of detecting any type of error that may be in the software. ": "Testing", "As testing is the _________ activity in software development, it is important that it is to be done efficiently.": "Costliest", "___________ is a white\nbox testing technique that focuses exclusively on validity of loop constructs.": "Loop testing", "In _____________ ,\nmethod selects test paths of a program according to the locations of\ndefinitions and uses of variables in the program.": "Data Flow Testing", "____________ is a ‘test\ncase design method’ that uses the control structure of the procedural design to\nderive test cases.": "White box\ntesting", "_______ refers to the\n‘response time’ or the system being installed.": "Performance Time\nTesting", "___________  is used to determine whether the system will\nhandle the volume of activities that occur, when the system is at peak of its\nprocessing demand.": "Peak Load Testing", "It has been observed that\nprograms that work correctly with a set of values, fail on some special values.\nFor boundary value analysis, it is useful to select the boundary elements of\nthe range and an invalid value just beyond the two ends (if the range is 0 to\n10 then the test cases should be 0, 10 (valid inputs) and -1 and 10.1 (for\ninvalid inputs).": "The correct answer is 'True'.", "Equivalent Class Partitioning\nmethod divides the input of a program into different classes of data. Test case\ndesign is based on defining an equivalent class for a particular input. An\nequivalence class represents a set of valid and invalid input values.": "The correct answer is 'True'.", "Maintenance is also the most expensive component\nof the____________.": "Software life cycle", "The first step in the ________ is to obtain a\nmaintenance request from a user.": "Maintenance Process", "Maintenance\nactivities can be broken down into ______ sub-activities.": "Four", "____________ involves fixing bugs or errors in the\nsystem as they are discovered.": "Corrective maintenance", "___________ is performed to make a computer\nprogram usable in a changed environment.": "Adaptive maintenance", "__________ is the act\nof improving the software’s functionality as a result of end-user requests to\nimprove product effectiveness.": "Perfective Maintenance", "¬¬¬¬¬¬¬¬¬¬_________ refers to performing ‘pre-maintenance’ in order to prevent system problems; it is different from corrective maintenance, which is performed to correct an existing problem.": "Preventive Maintenance", "Software _________ is defined as the process of\nanalyzing a system to identify the system components and their\ninter-relationships and to create representations of the system in another form\nat a higher level of abstraction.": "Reverse Engineering", "Input to the reverse engineering process is________.": "Source code", "An important part of managing maintenance is to\nunderstand and measure the effectiveness of the maintenance process.": "The correct answer is 'True'."}